#### Terraform Validation & Plan Results
* Terraform Version 📎`1.10.4`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].time_rotating.rotating_current: Refreshing state... [id=2025-01-23T21:25:09Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_admin: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_developer[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_reader[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_network_connectivity_config.network_connectivity_config: Refreshing state... [id=515f13c1-53bb-48fb-a2c9-75e3f5d943f5/9ea65e30-edd4-4eb0-be39-6f03a4cf9b2b][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_admin: Read complete after 2s [id=408985471222074][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_developer[0]: Read complete after 2s [id=66271379238954][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.databricks_group.group_reader[0]: Read complete after 2s [id=439960392122911][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_subscription.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_resource_group.resource_group_app_monitoring: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_location.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_consumption: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_resource_group.resource_group_app: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_engineering: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.azurerm_resource_group.resource_group_storage: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iODE1NWYyZC1kNGZiLTRmNTQtODBmZi0wNjM2Zjg4MDk2MmE7b2JqZWN0SWQ9OGNhNzk2M2EtNDZlYS00YjJhLWFhYzItMzY1NzE2MmFlOGI2O3N1YnNjcmlwdGlvbklkPTk4NDJiZTYzLWM4YzAtNDY0Ny1hNWQxLTBjNWU3ZjhiYmIyNTt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_monitor_action_group.monitor_action_group: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Insights/actionGroups/mydlz01-dptest-prd-ag001][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.databricks_access_connector.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-dptest-prd-dbac001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_subscription.current: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_access_connector_consumption.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-core-int-cnsmptn-dbac001][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_access_connector_engineering.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/accessConnectors/mydlz01-core-int-eng-dbac001][0m
[0m[1mmodule.data_landing_zone.module.platform.data.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mmodule.data_landing_zone.module.platform.azapi_update_resource.virtual_network: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_developer[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_reader[0]: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.azuread_service_principal.service_principal: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azurerm_location.current: Read complete after 3s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/locations/northeurope][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal_databricks: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal: Read complete after 1s [id=/servicePrincipals/e73816f4-d36e-4271-8f9b-ad2752bdbfaf][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_admin: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_developer[0]: Read complete after 1s [id=/groups/fd3a6a34-8e7c-4315-803a-eedba0cc4b83][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_consumption_budget_subscription.consumption_budget_subscription: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Consumption/budgets/mydlz01-dptest-prd-bdgt][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].data.azuread_service_principal.service_principal: Read complete after 2s [id=/servicePrincipals/e73816f4-d36e-4271-8f9b-ad2752bdbfaf][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_reader[0]: Read complete after 2s [id=/groups/46a9f467-c63d-4a24-8de9-bb148135bec5][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/0687fe6e-9b29-dfd8-4a86-ced0ecb704ef][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_service_principal.service_principal_databricks: Read complete after 1s [id=/servicePrincipals/7f7c7b4a-704d-4531-b73e-45e16b388271][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_monitor_activity_log_alert.monitor_activity_log_alert_service_health: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Insights/activityLogAlerts/mydlz01-dptest-prd-alert-servicehealth][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/ff1757a3-896e-2fb9-0604-4cbf3b29a8c3][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/e9129d05-89fd-9e1c-e388-d202bfa8b490][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_cognitive_services_usages_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Authorization/roleAssignments/9140f05a-6960-fe0a-af84-4654882c0a59][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/b755624a-d8b1-f41d-9b1d-bf008481f7bc][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].data.azuread_group.group_admin: Read complete after 2s [id=/groups/f3776135-9227-43a1-a4bd-b786a82878fc][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/4deda253-d63b-efad-2e13-15b9db14b4a3][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_service_principal.service_principal: Refreshing state... [id=8089508589893950][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/bf88415b-2a28-3cf7-4960-48cd863c3892][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/726f5d1a-3d5d-5222-25d7-6199804ff6e2][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_officer_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/f6773ac5-d6e9-1492-1f3e-ddf677d14a05][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_user_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/df1f7f66-eb4b-1c22-04c5-48194bf80b06][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.databricksresourceprovider_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/906c0cc9-8396-be24-af02-0c540eac3492][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_monitoring_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-monitoring-rg/providers/Microsoft.Authorization/roleAssignments/361604b3-b5ac-6f44-5092-ac05e89cce7e][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_app_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Authorization/roleAssignments/c9ce092b-0fd1-159e-31ff-e98269e8b583][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_key_vault_secrets_officer_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001/providers/Microsoft.Authorization/roleAssignments/e5392a17-6aae-3a91-7cea-0f833f2af337][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_cognitive_services_usages_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/providers/Microsoft.Authorization/roleAssignments/e6813840-c107-f68d-eb13-78b650269029][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/providers/Microsoft.Authorization/roleAssignments/c9f2e595-0434-def6-e552-9a9d5b7318cc][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/providers/Microsoft.Authorization/roleAssignments/a5a20344-86b4-8ad3-fed3-55e6c70067ea][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/providers/Microsoft.Authorization/roleAssignments/15900e91-a9a0-5c1d-9736-078a28e9b0e8][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/providers/Microsoft.Authorization/roleAssignments/913ad676-9e65-cf6a-2c0f-bac841617b9a][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/providers/Microsoft.Authorization/roleAssignments/1c14518f-2e5c-0be8-d11e-249eef74a954][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgenr-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgenr-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgext-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgext-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgcur-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgcur-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgraw-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgraw-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dptest-prd-kv001-vault-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgwks-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.azurerm_private_endpoint.private_endpoint_storage_account["dfs"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01coreintstgwks-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dptest-prd-fore-kv001-account-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_enriched.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-23T21:28:43Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-cnsmptn-dbw001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/c0a087d5-a9c0-a6ad-57aa-9285cc66e039][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/2778e6d0-f884-6b97-9504-9142960cfbf6][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_enriched: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_enriched_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/providers/Microsoft.Authorization/roleAssignments/2c7d37b3-1e32-b0a7-77a4-4e0fbad8c524][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_curated_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/providers/Microsoft.Authorization/roleAssignments/d93d90b9-ceb4-a8bf-cd66-1a889c3e047e][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_external: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/626d263b-b648-7ca6-244e-4f6cd0717e2f][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_raw_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/providers/Microsoft.Authorization/roleAssignments/edeedf30-7601-1d33-a93c-cc2941f73ede][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_resource_group_storage_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Authorization/roleAssignments/768e3a4a-49d3-2e14-5927-2943d7c2e707][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_external_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/providers/Microsoft.Authorization/roleAssignments/a27a8ae1-f4db-44b4-38b5-68d79edd120e][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_account_workspace_blob_delegator: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/providers/Microsoft.Authorization/roleAssignments/8ede1f4c-75cb-8aed-1571-a6817455262b][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_workspace: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_raw: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_storage_container.storage_container_curated: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_external.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-23T21:30:09Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_curated.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-23T21:29:54Z][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-enriched-dfs"]: Refreshing state... [id=9ea65e30-edd4-4eb0-be39-6f03a4cf9b2b/4c93f511-858a-4745-9fe9-1a3fe39a8c8e][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-raw-dfs"]: Refreshing state... [id=9ea65e30-edd4-4eb0-be39-6f03a4cf9b2b/d18f98d1-7a1d-4a7e-b9e1-49ead8a02bf2][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-workspace-blob"]: Refreshing state... [id=9ea65e30-edd4-4eb0-be39-6f03a4cf9b2b/efd3fbc5-fdb6-4de7-b750-5aa6ebdcc94e][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-curated-dfs"]: Refreshing state... [id=9ea65e30-edd4-4eb0-be39-6f03a4cf9b2b/c174f561-d9e2-45e8-93ed-de9f07ef9eae][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-raw-blob"]: Refreshing state... [id=9ea65e30-edd4-4eb0-be39-6f03a4cf9b2b/019210a3-de9e-4df4-bb0f-6f4bdac98812][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-curated-blob"]: Refreshing state... [id=9ea65e30-edd4-4eb0-be39-6f03a4cf9b2b/2537b4d9-fdf5-4b87-8182-2c6b6fdcacec][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-enriched-blob"]: Refreshing state... [id=9ea65e30-edd4-4eb0-be39-6f03a4cf9b2b/279b82ea-a680-431b-9cd5-f75b4e6efa17][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-external-dfs"]: Refreshing state... [id=9ea65e30-edd4-4eb0-be39-6f03a4cf9b2b/0110b74c-1a4c-423b-a260-05e33275819d][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-workspace-dfs"]: Refreshing state... [id=9ea65e30-edd4-4eb0-be39-6f03a4cf9b2b/a1dac65f-6efd-4674-8013-ab460b99d7bd][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_private_endpoint_rule.ncc_private_endpoint_rule["storage-account-external-blob"]: Refreshing state... [id=9ea65e30-edd4-4eb0-be39-6f03a4cf9b2b/1c70d202-455d-411e-8e70-00ca987dfb60][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-eng-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_raw.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-23T21:28:42Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-blob-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-uiapi-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-core-int-cnsmptn-dbw001-dfs-pe][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-23T21:28:03Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/ba9b54ad-6dbf-5c2d-0c37-f34129ccb738][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/bbd9631d-9a00-b497-c908-09f20d4e65c1][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 1s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/f9b139fb-0f6f-ff77-3560-f15bb13eabc7][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 0s [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-consumption-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-cnsmptn-dbw001][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_enriched_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/0a10ca2c-1c56-58f0-368f-57d64f405b2f][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_enriched_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgenr/blobServices/default/containers/mydlz01-dptest-prd-enr/providers/Microsoft.Authorization/roleAssignments/292aada9-cedf-0adc-b383-6e8aeea48c52][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/268845ac-2b01-3c83-090d-b7fa577a2bd8][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/74eec164-9e34-65c2-4e4b-9d54f3792b31][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/60de383c-34c2-8555-99f9-b44380ee745e][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_external_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/4689385f-412a-317e-c358-d98b2b6acf4c][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_external_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgext/blobServices/default/containers/mydlz01-dptest-prd-ext/providers/Microsoft.Authorization/roleAssignments/a43a131e-3391-6a50-3319-bad40b0c3f6c][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].module.ai_service["fore"].time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-23T21:28:34Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/f4574996-950f-9fc5-137a-b0753e1811fb][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_workspace_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/b8932a87-8c04-7436-7e3a-49b5d60eace7][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/bc43edc3-d13b-025a-2619-a4c3f7975b13][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/c3d61847-be59-1574-19af-d4b02721f8d2][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_workspace_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgwks/blobServices/default/containers/mydlz01-dptest-prd-wks/providers/Microsoft.Authorization/roleAssignments/cc00ba87-7cec-d5b6-c829-0feb29abf144][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/405ee60b-c02f-8711-541a-a8a50f7af025][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_raw_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/a542b237-75d1-98ad-46a8-42974ec3dd05][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/c0f2a981-de26-4399-6c0b-f56036450210][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/139d342f-6b9c-b43c-9b47-c355ed8098a5][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_raw_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgraw/blobServices/default/containers/mydlz01-dptest-prd-raw/providers/Microsoft.Authorization/roleAssignments/41da5858-79f7-fb99-f46c-40925464bee4][0m
[0m[1mmodule.data_landing_zone.module.core.module.storage_account_workspace.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-23T21:28:34Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.accessconnector_role_assignment_storage_container_curated_blob_data_contributor: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/8670be27-ad6c-9e4d-223f-83794fb3bd0e][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_owner_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/5619d180-a479-cf6e-e8a6-4a519fe946c0][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/29049d90-d851-68ba-3fb3-a5b89171a016][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_owner_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/4306a3bb-4023-0d26-e581-dc3100ea806e][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_storage_container_curated_blob_data_conributor_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01coreintstgcur/blobServices/default/containers/mydlz01-dptest-prd-cur/providers/Microsoft.Authorization/roleAssignments/c0f26c3a-ca36-e498-1de0-3f16c9431661][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-workspace-blob"]: Refreshing state... [id=5910523111804763614][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-enriched-blob"]: Refreshing state... [id=5016155700748889626][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-enriched-dfs"]: Refreshing state... [id=3427904591025667604][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-workspace-dfs"]: Refreshing state... [id=4376245122961378891][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-curated-blob"]: Refreshing state... [id=5270237133932986363][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-external-dfs"]: Refreshing state... [id=3193313461281483930][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-curated-dfs"]: Refreshing state... [id=5664412331041942427][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-raw-blob"]: Refreshing state... [id=5079377316548230373][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-external-blob"]: Refreshing state... [id=3391446350455127387][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.null_resource.ncc_private_endpoint_rule_approval["storage-account-raw-dfs"]: Refreshing state... [id=6578028053013807674][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_engineering.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-23T21:32:19Z][0m
[0m[1mmodule.data_landing_zone.module.core.module.databricks_workspace_consumption.time_sleep.sleep_connectivity: Refreshing state... [id=2025-01-23T21:31:56Z][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_developer["fore"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001/providers/Microsoft.Authorization/roleAssignments/73052e80-ee6b-bc24-9a08-0c46e2855645][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_service_principal["fore"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001/providers/Microsoft.Authorization/roleAssignments/c311fd54-b539-f754-6c35-372a39e43b4d][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_ai_service_admin["fore"]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.CognitiveServices/accounts/mydlz01-dptest-prd-fore-kv001/providers/Microsoft.Authorization/roleAssignments/b958a6fc-7c5a-134a-2a9e-1661268f8e39][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_service_principal: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/8cce6ada-bf13-8ac7-3ea2-7a7ee3145a99][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_admin: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/92a5d922-b198-27b6-68f8-966943ca870f][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_developer[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/b59254ef-5f82-c9ce-59e1-3fc59d6fd6ba][0m
[0m[1mmodule.data_landing_zone.module.data_application["dptest"].azurerm_role_assignment.role_assignment_databricks_workspace_reader_reader[0]: Refreshing state... [id=/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-core-int-engineering-rg/providers/Microsoft.Databricks/workspaces/mydlz01-core-int-eng-dbw001/providers/Microsoft.Authorization/roleAssignments/c14597c5-cd3e-e950-2e9e-2c6561823f61][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_binding.ncc_binding["consumption"]: Refreshing state... [id=4268214910828513/9ea65e30-edd4-4eb0-be39-6f03a4cf9b2b][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_mws_ncc_binding.ncc_binding["engineering"]: Refreshing state... [id=489760246989884/9ea65e30-edd4-4eb0-be39-6f03a4cf9b2b][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_cluster_policy.cluster_policy["JobComputePolicyPtt"]: Refreshing state... [id=0003CABB99A22E17][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_cluster_policy.cluster_policy["PersonalComputePolicyPtt"]: Refreshing state... [id=0012F019D6256A37][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_cluster_policy.cluster_policy["DltComputePolicyPtt"]: Refreshing state... [id=0008730438AF12E2][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["query"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|query][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["lakeflow"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|lakeflow][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["storage"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|storage][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["serving"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|serving][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["access"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|access][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["marketplace"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|marketplace][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["billing"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|billing][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_system_schema.system_schema["compute"]: Refreshing state... [id=091752ab-a9f5-437c-8d13-937f161bd3d6|compute][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_service_principal: Refreshing state... [id=8089508589893950][0m
[0m[1mmodule.data_landing_zone.module.databricks_core.databricks_workspace_conf.workspace_conf: Refreshing state... [id=_][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_directory.directory: Refreshing state... [id=/mydlz01-dptest-int][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_budget.budget[0]: Refreshing state... [id=515f13c1-53bb-48fb-a2c9-75e3f5d943f5|b0b32542-8577-45ea-8350-b5b3ba5efa77][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_secret_scope.secret_scope: Refreshing state... [id=mydlz01-dptest-int-secret-scope][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_storage_credential.storage_credential: Refreshing state... [id=mydlz01-dptest-int-cred][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_storage_credential_service_principal: Refreshing state... [id=storage_credential/mydlz01-dptest-int-cred/99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m
[0m[1mmodule.data_landing_zone.module.databricks_data_application["dptest"].databricks_secret_acl.secret_acl_service_principal: Refreshing state... [id=mydlz01-dptest-int-secret-scope|||99018e64-8a65-4af9-9d1e-f7a83c0aa8f0][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_catalog.catalog_external[0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "catalog_external" {
      [32m+[0m[0m comment                        = "Data Applicaton Catalog - dptest - External"
      [32m+[0m[0m enable_predictive_optimization = "DISABLE"
      [32m+[0m[0m force_destroy                  = true
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m isolation_mode                 = "OPEN"
      [32m+[0m[0m metastore_id                   = (known after apply)
      [32m+[0m[0m name                           = "mydlz01-dptest-int"
      [32m+[0m[0m owner                          = (known after apply)
      [32m+[0m[0m properties                     = {
          [32m+[0m[0m "app_name"    = "dptest"
          [32m+[0m[0m "costCenter"  = "ABCD1234"
          [32m+[0m[0m "environment" = "int"
          [32m+[0m[0m "location"    = "northeurope"
          [32m+[0m[0m "use"         = "external"
        }
      [32m+[0m[0m storage_root                   = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_catalog.catalog_internal[0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "catalog_internal" {
      [32m+[0m[0m comment                        = "Data Applicaton Catalog - dptest - Internal"
      [32m+[0m[0m enable_predictive_optimization = "DISABLE"
      [32m+[0m[0m force_destroy                  = true
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m isolation_mode                 = "ISOLATED"
      [32m+[0m[0m metastore_id                   = (known after apply)
      [32m+[0m[0m name                           = "mydlz01-dptest-int-int"
      [32m+[0m[0m owner                          = (known after apply)
      [32m+[0m[0m properties                     = {
          [32m+[0m[0m "app_name"    = "dptest"
          [32m+[0m[0m "costCenter"  = "ABCD1234"
          [32m+[0m[0m "environment" = "int"
          [32m+[0m[0m "location"    = "northeurope"
          [32m+[0m[0m "use"         = "internal"
        }
      [32m+[0m[0m storage_root                   = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_curated[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_curated" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default curated storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-cur"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-cur@mydlz01coreintstgcur.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_enriched[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_enriched" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default enriched storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-enr"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-enr@mydlz01coreintstgenr.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_external[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_external" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default external storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-ext"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-ext@mydlz01coreintstgext.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_raw[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_raw" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default raw storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-raw"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-raw@mydlz01coreintstgraw.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_external_location.external_location_workspace[0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "external_location_workspace" {
      [32m+[0m[0m browse_only     = (known after apply)
      [32m+[0m[0m comment         = "Default workspace storage layer for 'dptest' data application."
      [32m+[0m[0m created_at      = (known after apply)
      [32m+[0m[0m created_by      = (known after apply)
      [32m+[0m[0m credential_id   = (known after apply)
      [32m+[0m[0m credential_name = "mydlz01-dptest-int-cred"
      [32m+[0m[0m fallback        = false
      [32m+[0m[0m force_destroy   = true
      [32m+[0m[0m force_update    = true
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m isolation_mode  = "ISOLATION_MODE_ISOLATED"
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "mydlz01-dptest-int-wks"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m read_only       = false
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m updated_at      = (known after apply)
      [32m+[0m[0m updated_by      = (known after apply)
      [32m+[0m[0m url             = "abfss://mydlz01-dptest-prd-wks@mydlz01coreintstgwks.dfs.core.windows.net/"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_external_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_admin" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-admin"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_external_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_developer" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-developer"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_external_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_reader" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-reader"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_external_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_external_service_principal" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_internal_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_admin" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-admin"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_internal_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_developer" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-developer"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_internal_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_reader" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "app001-reader"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_catalog_internal_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_catalog_internal_service_principal" {
      [32m+[0m[0m catalog    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m principal  = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_FUNCTION",
          [32m+[0m[0m "CREATE_MATERIALIZED_VIEW",
          [32m+[0m[0m "CREATE_MODEL",
          [32m+[0m[0m "CREATE_SCHEMA",
          [32m+[0m[0m "CREATE_TABLE",
          [32m+[0m[0m "CREATE_VOLUME",
          [32m+[0m[0m "EXECUTE",
          [32m+[0m[0m "MODIFY",
          [32m+[0m[0m "READ_VOLUME",
          [32m+[0m[0m "REFRESH",
          [32m+[0m[0m "SELECT",
          [32m+[0m[0m "USE_CATALOG",
          [32m+[0m[0m "USE_SCHEMA",
          [32m+[0m[0m "WRITE_VOLUME",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_curated_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_curated_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_curated_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_curated_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_curated_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_enriched_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_enriched_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_enriched_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_enriched_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_enriched_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_external_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_external_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_external_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_external_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_external_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_raw_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_raw_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_raw_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_raw_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_raw_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_workspace_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_admin" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-admin"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_workspace_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_developer" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-developer"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_workspace_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_reader" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "app001-reader"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "READ_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_external_location_workspace_service_principal[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_external_location_workspace_service_principal" {
      [32m+[0m[0m external_location = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m principal         = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
      [32m+[0m[0m privileges        = [
          [32m+[0m[0m "BROWSE",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "CREATE_EXTERNAL_VOLUME",
          [32m+[0m[0m "CREATE_FOREIGN_SECURABLE",
          [32m+[0m[0m "CREATE_MANAGED_STORAGE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_storage_credential_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_storage_credential_admin" {
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m principal          = "app001-admin"
      [32m+[0m[0m privileges         = [
          [32m+[0m[0m "CREATE EXTERNAL LOCATION",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
      [32m+[0m[0m storage_credential = "mydlz01-dptest-int-cred"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_storage_credential_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_storage_credential_developer" {
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m principal          = "app001-developer"
      [32m+[0m[0m privileges         = [
          [32m+[0m[0m "CREATE EXTERNAL LOCATION",
          [32m+[0m[0m "CREATE_EXTERNAL_TABLE",
          [32m+[0m[0m "READ_FILES",
          [32m+[0m[0m "WRITE_FILES",
        ]
      [32m+[0m[0m storage_credential = "mydlz01-dptest-int-cred"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_grant.grant_storage_credential_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grant" "grant_storage_credential_reader" {
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m principal          = "app001-reader"
      [32m+[0m[0m privileges         = [
          [32m+[0m[0m "READ_FILES",
        ]
      [32m+[0m[0m storage_credential = "mydlz01-dptest-int-cred"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_permission_assignment" "permission_assignment_admin" {
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m permissions  = [
          [32m+[0m[0m "USER",
        ]
      [32m+[0m[0m principal_id = 408985471222074
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_permission_assignment" "permission_assignment_developer" {
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m permissions  = [
          [32m+[0m[0m "USER",
        ]
      [32m+[0m[0m principal_id = 66271379238954
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permission_assignment.permission_assignment_reader[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_permission_assignment" "permission_assignment_reader" {
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m permissions  = [
          [32m+[0m[0m "USER",
        ]
      [32m+[0m[0m principal_id = 439960392122911
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_cluster_policy["DltComputePolicyPtt"][0m will be created
[0m  [32m+[0m[0m resource "databricks_permissions" "permissions_cluster_policy" {
      [32m+[0m[0m cluster_policy_id = "0008730438AF12E2"
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m object_type       = (known after apply)

      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_USE"
          [32m+[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-admin"
          [32m+[0m[0m permission_level       = "CAN_USE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_cluster_policy["JobComputePolicyPtt"][0m will be created
[0m  [32m+[0m[0m resource "databricks_permissions" "permissions_cluster_policy" {
      [32m+[0m[0m cluster_policy_id = "0003CABB99A22E17"
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m object_type       = (known after apply)

      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_USE"
          [32m+[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-admin"
          [32m+[0m[0m permission_level       = "CAN_USE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_cluster_policy["PersonalComputePolicyPtt"][0m will be created
[0m  [32m+[0m[0m resource "databricks_permissions" "permissions_cluster_policy" {
      [32m+[0m[0m cluster_policy_id = "0012F019D6256A37"
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m object_type       = (known after apply)

      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_USE"
          [32m+[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-admin"
          [32m+[0m[0m permission_level       = "CAN_USE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_permissions.permissions_directory[0m will be created
[0m  [32m+[0m[0m resource "databricks_permissions" "permissions_directory" {
      [32m+[0m[0m directory_path = "/mydlz01-dptest-int"
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m object_type    = (known after apply)

      [32m+[0m[0m access_control {
          [32m+[0m[0m permission_level       = "CAN_MANAGE"
          [32m+[0m[0m service_principal_name = "99018e64-8a65-4af9-9d1e-f7a83c0aa8f0"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-admin"
          [32m+[0m[0m permission_level       = "CAN_MANAGE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-developer"
          [32m+[0m[0m permission_level       = "CAN_MANAGE"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [32m+[0m[0m access_control {
          [32m+[0m[0m group_name             = "app001-reader"
          [32m+[0m[0m permission_level       = "CAN_READ"
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_secret_acl.secret_acl_admin[0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_acl" "secret_acl_admin" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m permission = "READ"
      [32m+[0m[0m principal  = "app001-admin"
      [32m+[0m[0m scope      = "mydlz01-dptest-int-secret-scope"
    }

[1m  # module.data_landing_zone.module.databricks_data_application["dptest"].databricks_secret_acl.secret_acl_developer[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_acl" "secret_acl_developer" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m permission = "READ"
      [32m+[0m[0m principal  = "app001-developer"
      [32m+[0m[0m scope      = "mydlz01-dptest-int-secret-scope"
    }

[1m  # module.data_landing_zone.module.data_application["dptest"].module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001"
    }

[1m  # module.data_landing_zone.module.data_application["dptest"].module.key_vault.azurerm_key_vault.key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "key_vault" {
      [33m~[0m[0m access_policy                   = [
          [31m-[0m[0m {
              [31m-[0m[0m certificate_permissions = []
              [31m-[0m[0m key_permissions         = []
              [31m-[0m[0m object_id               = "7f7c7b4a-704d-4531-b73e-45e16b388271"
              [31m-[0m[0m secret_permissions      = [
                  [31m-[0m[0m "Get",
                  [31m-[0m[0m "List",
                ]
              [31m-[0m[0m storage_permissions     = []
              [31m-[0m[0m tenant_id               = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ]
        id                              = "/subscriptions/9842be63-c8c0-4647-a5d1-0c5e7f8bbb25/resourceGroups/mydlz01-dptest-prd-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dptest-prd-kv001"
        name                            = "mydlz01-dptest-prd-kv001"
        tags                            = {
            "costCenter" = "ABCD1234"
        }
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1mPlan:[0m 47 to add, 1 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mReference to undefined provider[0m
[33m│[0m [0m
[33m│[0m [0m[0m  on ../../databricksconfiguration.tf line 7, in module "databricks_core":
[33m│[0m [0m   7:     [4mnull[0m               = null[0m
[33m│[0m [0m
[33m│[0m [0mThere is no explicit declaration for local provider name "null" in
[33m│[0m [0mmodule.data_landing_zone.module.databricks_core, so Terraform is assuming
[33m│[0m [0myou mean to pass a configuration for "hashicorp/null".
[33m│[0m [0m
[33m│[0m [0mIf you also control the child module, add a required_providers entry named
[33m│[0m [0m"null" with the source address "hashicorp/null".
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>